# Используем официальный образ Python
FROM python:3.12-slim

# Устанавливаем рабочую директорию
WORKDIR /app

# Копируем файл с зависимостями
COPY requirements.txt .

# Устанавливаем зависимости
RUN pip install --no-cache-dir -r requirements.txt

# Копируем остальные файлы проекта
COPY . .

# Команда для запуска веб-приложения с Gunicorn
# -w: количество worker-процессов (рекомендуется 2 * количество_ядер + 1)
# -b: адрес и порт для прослушивания
# web.app:app указывает на модуль web/app.py и Flask-приложение с именем 'app' внутри него
CMD ["gunicorn", "-w", "4", "-b", "0.0.0.0:5000", "web.app:app"]